import React, {Component} from 'react'

class Agreement extends Component {
    render() {
        return (
          <div className="agreement">
            <ul>
              <li>
                <i>提示：</i>
                <p>以下为您将要与北京优集品网络科技有限公司（“优集品”）签署的《会员服务协议》（“本协议”），请仔细阅读协议全文。如果您不同意本协议的任何条款，请退出此页面或选择“拒绝接受”，而不要点击“同意接受”，因为点击“同意接受”即表示您已与优集品签署了本协议，且本协议将立即生效，对您产生法律约束力。请注意，我们可能会不定期修改本协议，并将更新后的版本公布在客户端上，并提示您浏览及确认是否同意接受，该协议为电子合同，具有同等法律效力。</p>
              </li>
            </ul>
            <h1>会员服务协议</h1>
            <ul>
              <li>
                  <p>本会员服务协议（“本协议”）由北京优集品网络科技有限公司（“优集品”）与根据本协议注册为优集品U-PASS优悦会的人士（“会员”）签署，以约定优集品向其会员提供的服务以及会员享受的权利和应尽的义务。</p>
              </li>
              <li>
                  <p>一、注册会员的前提条件</p>
                  <p>优集品只接受年满18周岁且具有完全民事行为能力的自然人作为其会员。如任何个人不符合前述条件，将不能注册成为优集品的会员。如该等人士以虚假的信息进行注册，由此可能引发相关行为不具有法律效力的后果且由于其行为造成本网站或他人财产或人身权益损害或无法实现合同目的，该等人士的监护人应对此负责并承担赔偿责任。</p>
              </li>
              <li>
                  <p>二、会员注册程序</p>
                  <p>申请人应通过优集品APP的注册页面填写完成注册所需的个人信息（包括姓名、身份证号码、电子邮箱和手机号码等联系方式等），设置优集品会员账号及密码，并提交给优集品审核。</p>
                  <p>会员资格的有效期为一年，自会员完成注册并支付会员费之日起算，实体会员卡的会员资格有效期以卡上写明的日期为准。会员有效期届满之前，优集品会通过手机短信和/或微信提示会员，按照优集品届时公布的会员费用标准续费，以继续拥有会员资格。如会员未能在有效期届满之前续费，则其会员资格自动终止，将不再享受任何U-PASS优悦会的服务（实体会员卡以卡面有效期为准），但其可以在之后任何时间内按上述程序重新注册为会员，并在根据本协议交纳会员费会享受U-PASS优悦会的服务。</p>
              </li>
              <li>
                  <p>三、会员费</p>
                  <p>会员费为每年299元人民币。会员可根据支付提示通过银行转账、支付宝、微信支付等方式完成支付。</p>
                  <p>优集品可随时自行决定对会员费标准进行调整，新的会员费标准自在优集品网站上公布之日起生效，但已注册缴费的会员在剩余的会员期限内不受新的会员费标准影响。</p>
                  <p>除本协议另有约定外，优集品会员卡一经售出，概不退换，亦不退还任何会员费。</p>
              </li>
              <li>
                  <p>四、会员卡的变更或补办</p>
                  <p>1.会员卡变更</p>
                  <p>在会员期限内，若会员的基本信息有任何变更，其可通过登录会员帐户，对基本信息进行变更与修改</p>
                  <p>会员信息的变更不影响其会员期限。变更信息后，会员在其剩余会员期限内继续享受优集品的会员待遇。</p>
                  <p>会员对自行修改的个人信息负责，由于变更信息导致的任何损失，会员自行承担</p>
                  <p>2. 实体会员卡遗失及补办</p>
                  <p>会员遗失实体会员卡后，应第一时间拨打优集品客服电话（4000-788-738）进行挂失。每名会员每一年可免费补办一次会员卡。第二次及以后补办，应每次交纳30元人民币的补卡及快递手续费</p>
                  <p>在会员卡挂失前，会员卡被他人冒用的风险及可能造成的损失，应由会员本人承担。</p>
              </li>
              <li>
                  <p>五、会员的权利</p>
                  <p>除优集品提供的常规商品及服务外，会员还可享受以下特权福利：</p>
                  <p>（1）会员可享受专享的额外折扣，具体信息见活动页面公示</p>
                  <p>（2）会员专享商品，该等限量或稀缺商品仅限会员购买；</p>
                  <p>（3）合作品牌专属福利。优集品不定期与不同业态品牌进行合作，使会员可在购买合作品牌的商品或线下服务时，享受专属的优惠；会员在享受该等福利和优惠时，应向合作品牌出示实体或电子会员卡；</p>
                  <p>（4）专属客服，优集品将为每位会员安排专属客服，为会员提供专业的咨询和售后服务；</p>
                  <p>（5）15天自动保价，指会员购物时，在签收商品后15天内（以物流公司提供的签收信息为准），如会员发现优集品网站或APP上显示已购买商品的价格下降，低于购买时价格时，可以申请一次差额保价服务</p>
                  <p>（6）优集品提供商品的优先物流服务。</p>
              </li>
              <li>
                  <p>六、会员义务</p>
                  <p>1、如实提供信息。通过注册为优集品的会员，会员同意：(a) 根据优集品所刊载的会员资料表格的要求，提供真实、准确、完整的个人资料；(b) 维持并及时更新会员资料，使其保持真实、准确、完整。</p>
                  <p>2、会员应妥善保管保护其会员账号及密码的安全，且须对其本人注册账号和密码下发生的所有活动承担责任。会员不得向其他任何人泄露账号或密码，亦不可使用其他任何人的账号或密码。因黑客、病毒或用户疏于保管等原因导致会员的账号遭他人非法使用的，优集品不承担任何责任。</p>
                  <p>3、如会员发现任何人未经授权使用其会员账号或密码，会员应立即通知优集品客服人员，要求优集品暂停相关服务，否则由此产生的一切责任由其本人承担。同时，会员理解并同意，优集品采取行动需要合理期限，在此之前，第三人使用该服务所导致的损失应由其本人承担。 用户账户操作所产生的电子信息记录均为用户行为的有效凭据，并由该用户本人承担由此产生的全部责任。</p>
                  <p>4、在通过优集品平台购物时，遵守国家法律法规和优集品平台不时公布和更新的购物政策</p>
              </li>
              <li>
                  <p>七、会员承诺</p>
                  <p>1、会员理解并保证，您在使用会员服务过程中遵守诚实信用原则。如优集品发现或有合理理由怀疑您存在以下任一情况的：</p>
                  <p> （1）通过任何不正当手段或以违反诚实信用原则的方式开通会员服务的，包括但不限于通过恶意软件绕过优集品设定的正常流程开通会员服务；<br/>
                      （2）您提供的资料不合法，不真实，包括但不限于盗用他人信息<br/>
                      （3）您通过优集品会员专区购买的商品并非用于个人消费或使用用途的；<br/>
                      （4）优集品有合理理由怀疑您存在违反诚实信用原则的其他行为。则，优集品有权拒绝会员的服务开通需求；若已开通的，优集品有权单方面取消您的会员资格且不退还您支付的会员服务费用。</p>
              </li>
              <li>
                  <p>八、风险提示</p>
                  <p>1、会员了解并同意，其在通过优集品网站进行交易时，可能遇到以下风险。该等风险，应由其个人完全承担，优集品对此不承担任何责任。<br/>
                  （1）政策风险：有关法律、法规及相关政策、规则发生变化，可能引起价格、利率、交易方式、转帐规定等方面的变化，用户可能因此遭受损失；<br/>
                  （2）不可抗力风险：自然灾害、战争、社会动乱等不可预料、不可避免的不可抗力因素可严重影响优集品网站的服务或交易的完成及履行，用户可能因此遭受损失<br/>
                  （3）因用户的重大疏忽或过错导致损失的风险，包括但不限于：决策失误、操作不当、遗忘或泄露密码、密码被他人破解、使用的计算机系统被第三方侵入、委托他人代理交易时他人恶意或不当操作而造成损失等。</p>
                  <p>2、本条提示内容并未涵盖通过优集品网站进行交易所可能面临的全部风险，会员应在作出交易前，充分了解并考虑以上风险和全部可能的其它风险因素。</p>
              </li>
              <li>
                  <p>九、隐私保护</p>
                  <p>1、优集品根据适用的相关法律法规的规定，采取合理措施严格保护用户的个人隐私信息，包括用户真实姓名、手机号码、身份证号码、银行帐号等个人信息。优集品对于用户提供的、优集品自行收集的用户个人信息将按照本协议予以保护、使用或者披露。</p>
                  <p>2、用户同意优集品可为解决争议之目的，使用用户的相关资料（包括但不限于用户注册档案中的资料、优集品从当前及之后通过优集品平台所获取的用户其他资料以及优集品通过其他方式收集的用户资料）</p>
                  <p>3、优集品按法律要求对用户的个人信息进行保护，除以下情况外，未经用户同意，优集品不向除为提供服务需要接触到该等隐私信息的管理人员、员工、合作单位的人员以外的第三方披露用户个人隐私信息：<br/>
                  （1）提供独立服务且仅要求服务相关的必要信息的供应商，如印刷厂、邮递公司等<br/>
                  （2）具有合法调阅信息权限并从合法渠道调阅信息的政府部门或其他机构，如公安机关、法院等；<br/>
                  （3）经平台使用方或平台使用方授权代表同意的第三方。</p>
              </li>
              <li>
                  <p>十、违约责任</p>
                  <p>1、会员或优集品任何一方违反本协议的约定，即构成违约，违约方应当向守约方承担违约责任。</p>
                  <p>2、如因会员提供的信息不真实、不完整或不准确给优集品造成损失的， 优集品有权要求会员赔偿对优集品的损失。</p>
                  <p>3、如会员违反法律法规规定或本协议约定，在优集品从事非法活动的，优集品有权立即终止对其提供 服务，注销其账号及会员卡，并要求其赔偿由此给优集品造成的损失。</p>
                  <p>4、如会员虚构事实等方式恶意诋毁优集品的商誉，优集品有权要求会员向其公开道歉，赔偿会员给优集品造成的损失，并有权终止对其提供 服务，注销其账号及会员卡。</p>
              </li>
              <li>
                  <p>十一、法律责任限制</p>
                  <p>1、对因服务器的死机、网络故障、数据库故障、软件升级、服务器维修、调整、升级等问题，或其他不可抗力（包括但不限于政府行为、自然灾害、黑客攻击等）造成的服务中断和对会员个人数据及资料造成的损失，优集品不承担责任。但是优集品将尽可能合理地协助处理善后事宜，并努力使会员免受经济损失。</p>
                  <p>2、除了优集品的使用条件中规定的其它限制和除外情况之外，在中国法律法规所允许的限度内，对于因交易而引起的或与之有关的任何直接的、间接的、特殊的、附带的或惩罚性的损害，或任何其它性质的损害，优集品及其董事、管理人员、雇员、代理或其它代表在任何情况下都不承担责任。优集品的全部责任，不论是合同、保证、侵权(包括过失)项下的还是其它的责任，均不超过会员在相关交易中购买的与该索赔有关的商品价值额。</p>
                  <p>3、优集品会谨慎选择信用良好的品牌作为其合作伙伴，向会员提供优惠的商品和服务，但不对该等品牌的商品或服务的质量进行任何类型的担保，不论是明确的或隐含的，包括所有有关信息真实性、适商性、适用于某一特定用途、所有权和非侵权性的默示担保和条件，对于因此产生的任何直接、间接、偶然、特殊及继起的损害，优集品不承担任何赔偿责任。但在会员因购买商品或服务时与优集品合作品牌发生争议，优集品将尽可能协调合作品牌，协助会员妥善解决该等争议。</p>
                  <p>4、优集品不保证现有的合作品牌会持续，或基于同样的条件进行合作。</p>
                  <p>5、对于会员在优集品或优集品合作品牌客户端在线购买的产品，因不可抗力或厂家原因造成产品交付时间延误的（“不可抗力”指不可预见、不可避免和不可克服的客观情况，包括但不限于政府行为、邮政主管部门政策变化、战争、地震、台风、洪水、火灾等其他类似事件），优集品不承担任何赔偿责任。</p>
                  <p>6、优集品严格按照商品实际情况描述其品牌、产地、规格、包装及贮存方式。会员无客观依据，仅凭主观感受认定商品或服务描述与实际不符的，优集品不承担任何赔偿责任。</p>
                  <p>7、会员应自行负责妥善且正确地保管、使用、维护其会员账户及账户密码和会员卡。会员应对账户密码采取必要和有效的保密措施，包括但不限于对您所持有的移动设备进行密码或指纹验证设置。非因优集品的原因导致会员账户密码泄漏或因会员保管、使用、维护不当造成损失的，优集品无须承担与此相关的任何责任。</p>
                  <p>8、由于会员将个人密码告知他人或与他人共享会员账户而导致的任何个人资料泄露，优集品不负任何责任。会员须对自身在使用优集品所提供的会员服务时的一切行为、行动（不论是否故意）负全部责任。</p>
                  <p>9、会员应理解并同意，本协议约定的付款或充值方式为通过第三方支付平台付款的充值方式，会员通过此种支付方式充值可能存在一定的商业风险（包括但不限于不法分子利用会员账户或银行卡等有价卡等进行违法活动），该等风险均会给会员造成相应的经济损失。为此，会员同意优集品在充分履行其在本协议项下全部义务及勤勉谨慎义务的前提下，不对会员的前述风险和损失承担任何责任；优集品亦不承担向违法犯罪嫌疑人或侵权者追究责任或者代其向会员承担损失的任何责任和义务</p>
              </li>
              <li>
                  <p>十二、本协议的修改</p>
                  <p>优集品可能不定期修改本协议的有关条款，并将在优集品网站和APP首页提示修改信息。如果不同意优集品对本协议所做的修改，则会员可以确认不接受修改。在此情况下，该会员与优集品之间仍适用未修改之前的协议内容，直至该会员的期限届满。如果会员未确认不接受修改，则视该会员接受服务条款的修改。</p>
              </li>
              <li>
                  <p>十三、其他条款</p>
                  <p>1、本协议由会员与优集品共同签订，适用于会员在本网站及当期提供的全部商品和活动。本协议未约定的与商品交易和服务相关的内容，适用优集品不时在其网站和APP上公布的购物指南和消费者告知书及其它相关的政策和公告。</p>
                  <p>2、本协议为电子合同，会员在优集品注册页面完成注册信息填写，阅读本协议内容并点击确认“本人已阅读并同意协议内容”键之后，即完成电子合同的签署。</p>
                  <p>3.本协议中的任何条款因任何原因被判定为无效或不可执行，则该条款应不再作为本协议的一部分，并可由反映双方在该条款中的意图并合法有效的条款所替代。在此情况下，本协议的其他条款仍然完全有效并具有约束力。</p>
                  <p>4.除非另有明确规定，与本协议有关的任何通知应以电子邮件、微信或手机短信的形式发送。优集品的电子邮件、微信和手机号码为优集品工作人员的电子邮箱、微信和手机号码，会员的电子邮件、微信和手机号码为其注册会员时提供的信息及之后更新的信息。 </p>
                  <p>5.本协议的解释、效力或履行，均适用中国法律。因本协议引起的或与本协议相关的任何争议，应由双方协商解决。协商不成的，任何一方可将争议提交至北京仲裁委员会，根据其届时适用的仲裁规则进行仲裁。</p>
              </li>

            </ul>

            <h3>北京优集品网络科技有限公司</h3>


          </div>


                )
            }
        }

export default Agreement
